{
    "basics": {
        "name": "Weiyue Wang",
        "label": "Postdoctoral Research Fellow",
        "image": "",
        "email": "wywang27@gmail.com",
        "url": "https://weiyue-wang.com",
        "address": "SRB 601A, 1825 Pressler Street, Houston, TX 77030, USA",
        "location": {
            "address": "1825 Pressler Street",
            "postalCode": "TX 77030",
            "city": "Houston",
            "countryCode": "US",
            "region": "Texas"
        },
        "profiles": [
            {
                "network": "Linkedin",
                "username": "weiyue-wang",
                "url": "https://www.linkedin.com/in/weiyue-wang/"
            }
        ]
    },
    "research_experience": [
        {
            "name": "Center for Cardiovascular Genetics, The Brown Foundation Institute of Molecular Medicine, The University of Texas Health Science Center at Houston, Houston, TX",
            "position": "Postdoctoral Research Fellow",
            "startDate": "2023-10-01",
            "summary": "Advisor: Ali J. Marian, MD",
            "highlights": [
                "Leading multiple research projects investigating the role of cytosolic DNA in cardiovascular aging.",
                "Independently conducted molecular biology experiments in cell and mouse models, including but not exclusive to myocyte and fibroblast isolation and culture, Immunoblotting, Immunofluorescence staining, Immunoprecipitation, RT-PCR, RNA-Seq, DNA-Seq, genotyping, mitochondria and cytosol isolation, etc.",
                "Research article published at JCI Insight."
            ]
        },
        {
            "name": "Department of Biochemistry and Molecular Biology, Department of Cardiovascular Medicine, Mayo Clinic, Rochester, MN",
            "position": "Research Trainee",
            "startDate": "2022-09-01",
            "endDate": "2023-09-30",
            "summary": "Advisor: Xiaolei Xu, PhD",
            "highlights": [
                "Led a research project investigating the dysregulated signaling pathways behind TTNtv-DCM and discovering novel therapeutics for the disease using zebrafish genetics.",
                "Independently conducted the experiments, including genotyping, western blot, RT-qPCR, IF staining, echocardiography, RNA-Seq analysis, CRISPR/Cas9, etc. Responsible for zebrafish feeding and facility maintenance once per month.",
                "Presented the project orally at 2023 ACRE@ISHR-NAS Pre-Conference Symposium. Presented a research poster at 2023 ISHR-NAS meeting.",
                "Research article published at Journal of Molecular and Cellular Cardiology."
            ]
        },
        {
            "name": "Department of Urology, Department of Oncology, Fudan University Shanghai Cancer Center, Shanghai, China",
            "position": "Undergraduate Researcher",
            "startDate": "2020-02-01",
            "endDate": "2020-05-01",
            "summary": "Advisor: Dingwei Ye, MD/PhD",
            "highlights": [
                "Assisted in a research project investigating the potential prognostic protein biomarkers using proteomic analysis in prostate cancer patients.",
                "Responsible for data curation and formal analysis using Gene Set Enrichment Analysis and Functional Enrichment Analysis, Microsoft Office, etc.",
                "Research article published at Phenomics."
            ]
        }
    ],
    "professional_experience": [
        {
            "name": "Accelerated Clinical Experience Program, University of California San Diego, La jolla, CA",
            "position": "Visiting scholar",
            "startDate": "2022-06-01",
            "endDate": "2022-08-30",
            "summary": "Advisor: Farshad Raissi, MD/MPH/FHRS; Luis Castellanos, MD/MPH",
            "highlights": [
                "Completed a three-month integrated clinical certificate program learning about clinical practices in the U.S., under supervision of two cardiologists in both inpatient and outpatient settings."
            ]
        },
        {
            "name": "Department of Neonatology, University of Illinois Chicago, Chicago, IL",
            "position": "Visiting Medical Student",
            "startDate": "2022-03-15",
            "endDate": "2023-05-01",
            "highlights": [
                "Completed one-month elective rotation in Neonatal Intensive Care Unit, achieving progressively more patient management responsibilities in critical care settings, under supervision of pediatricians from UI Health."
            ]
        },
        {
            "name": "The 17th Inter-Medical School Physiology Quiz (IMSPQ), University of Indonesia, Jakarta, Indonesia",
            "position": "Finalist",
            "startDate": "2019-08-21",
            "endDate": "2019-08-23",
            "highlights": [
                "Competed with medical students from different countries in physiology on behalf of my medical school."
            ]
        }
    ],
    "volunteer": [
        {
            "organization": "Memorial Hermann Health System",
            "location": "Houston, TX",
            "position": "Emergency Room Volunteer",
            "startDate": "2025-02-01",
            "endDate": "2024-05-01",
            "highlights": [
                "Served a four-hour shift per week in the emergency room.",
                "Duties included gloves distribution, sheet and pillar cleaning, snacks distribution, etc."
            ]
        },
        {
            "organization": "Shanghai USMLE Group (SHUG) Summer Course",
            "location": "Shanghai, China",
            "position": "Organizer/Lecturer",
            "startDate": "2021-07-01",
            "endDate": "2021-08-01",
            "highlights": [
                "Organized, scheduled and evaluated a 2-week intensive course providing over 40 Chinese medical students with introduction to the United States Medical Licensing Examination Step 1.",
                "Facilitated panel of residents and attendings in the U.S. to speak about their careers and connect with students.",
                "Gave 3 online lectures on Physiology, Cardiovascular pathology, etc."
            ]
        },
        {
            "organization": "Oregon Food Bank",
            "location": "Portland, OR",
            "position": "Volunteer",
            "startDate": "2019-07-01",
            "endDate": "2019-08-01",
            "highlights": [
                "Worked with other volunteers to sort, organize, and shelve food donations.",
                "Responsible for distributing food to program beneficiaries, loading and unloading items, removing all spoiled food."
            ]
        },
        {
            "organization": "Luoma Elementary School",
            "location": "Hainan, China",
            "position": "Volunteer Teacher",
            "startDate": "2018-01-01",
            "endDate": "2018-02-01",
            "highlights": [
                "Designed special curriculum for children to understand basic medical knowledge and educated them on healthcare-related topics.",
                "Home-visited several students to strengthen the family's knowledge of child development, health, nutrition and community resources."
            ]
        },
        {
            "organization": "Parasitology Lecture Series",
            "location": "Zhejiang, China",
            "position": "Student Coordinator/Lecturer",
            "startDate": "2017-01-01",
            "endDate": "2017-02-01",
            "highlights": [
                "Organized a series of parasitology lectures in multiple places across the province, including high schools and senior communities.",
                "Designed posters, booklets, lectures to educate the public on common parasitology-related health issues.",
                "Planned, implemented, and coordinated survey to understand the public’s knowledge of parasitology and provide feedback to Department of Medical Microbiology and Parasitology."
            ]
        }
    ],
    "education": [
        {
            "institution": "Shanghai Medical College, Fudan University",
            "location": "Shanghai, China",
            "url": "https://shmc.fudan.edu.cn/eng/main.htm",
            "area": "Medicine",
            "studyType": "Bachelor of Medicine, MD equivalent",
            "startDate": "2016-09-01",
            "endDate": "2022-06-30",
            "courses": [
                "Graduation with honors",
                "GPA (overall):3.56/4.0 (17/208)"
            ]
        }
    ],
    "awards": [
        {
            "title": "The Margaret Moffat Poster Award",
            "date": "2024-09-22",
            "awarder": "International Academy of Cardiovascular Sciences (IACS-NAS)",
            "url": "https://iacs-nas.org/2024-annual-conference/",
            "summary": "Best poster award at the 11th Annual Meeting of the North American Section of the International Academy of Cardiovascular Sciences (IACS-NAS), Houston, TX."
        }
    ],
    "certificates": [
        {
            "name": "Educational Commission for Foreign Medical Graduates Certification (ECFMG) Certification",
            "date": "2023-10-06",
            "issuer": "ECFMG",
            "url": "https://www.ecfmg.org/certification/"
        }
    ],
    "publications": [
        {
            "name": "Cardiac Myocyte Cytosolic Self-DNA Contributes to the Pathogenesis of Desmoplakin-Cardiomyopathy",
            "publisher": "JCI Insight",
            "releaseDate": "2025-07-03",
            "url": "https://insight.jci.org/articles/view/192283"
        },
        {
            "name": "Deregulated nutrient response in ttntv cardiomyopathy can be repaired via Erk inhibition for cardioprotective effects",
            "publisher": "Journal of Molecular and Cellular Cardiology",
            "releaseDate": "2025-07-10",
            "url": "https://www.jmcc-online.com/article/S0022-2828(25)00117-8/fulltext?rss=yes"
        },
        {
            "name": "The cGAS/STING Pathway: Friend or Foe in Regulating Cardiomyopathy",
            "publisher": "Cells",
            "releaseDate": "2025-05-25",
            "url": "https://www.mdpi.com/2073-4409/14/11/778"
        },
        {
            "name": "Large-Scale Proteomics Data Reveal Integrated Prognosis-Related Protein Signatures and Role of SMAD4 and RAD50 in Prognosis and Immune Infiltrations of Prostate Cancer Microenvironment",
            "publisher": "Phenomics",
            "releaseDate": "2022-09-27",
            "url": "https://doi.org/10.1007/s43657-022-00070-1"
        }
    ],
    "skills": [
        {
            "name": "Dry lab",
            "level": "Master",
            "icon": "fa-solid fa-hashtag",
            "keywords": [
                "RNA-Sequencing data analysis: fastqc, fastp, STAR, featureCounts, DESeq2, PCA, IPA analysis, GO analysis, GSEA analysis, KEGG analysis, DAVID analysis, etc.",
                "SNP-calling: Picard, GATK4, Annovar, etc.",
                "Software: R, Python, Visual Basic, Image J, GraphPad Prism, SnapGene, DsGenes, Photoshop, Synthego ICE CRISPR analysis, Vevo LAB, Microsoft Office, Final Cut Pro X, Pixelmator Pro, Procreate, iMovie, etc."
            ]
        },
        {
            "name": "Wet lab",
            "level": "Master",
            "icon": "fa-solid fa-hashtag",
            "keywords": [
                "Molecular Biology: PCR, RT-PCR, RT-qPCR, DNA & RNA extraction, electrophoresis, Western blot, Co-IP, DNA Sequencing, genotyping, CRISPR-Cas9, etc.",
                "Immunology: IHC, ELISA, IF staining, etc.",
                "Cellular Biology: myocyte isolation, mitochondria isolation, cytosol isolation, nuclear isolation, cell culture, cell cryopreservation & resuscitation, etc.",
                "Animal Research: zebrafish echocardiography, zebrafish dechorionation, zebrafish breeding, zebrafish facility maintenance; mouse colony management, intraperitoneal injection, mouse echocardiography, mouse EKG, etc.",
                "Others: Transmission electron microscopy, Mass spectrometry, Confocal Microscopy, etc."
            ]
        }
    ],
    "languages": [
        {
            "language": "Mandarin",
            "fluency": "Native speaker",
            "icon": ""
        },
        {
            "language": "English",
            "fluency": "Fluent",
            "icon": ""
        },
        {
            "language": "Wu Chinese",
            "fluency": "Native Speaker",
            "icon": ""
        }
    ]
}
